# C++ 重温知识与编程要点

#### 头文件重复问题

头文件重复包含的影响

1. 使预处理的速度变慢了，要处理很多本来不需要处理的头文件。
2. 可能预处理器就陷入死循环了（其实编译器都会规定一个包含层数的上限）。例如C.h包含D.h，D.h又包含C.h的情况，如果不采用防止头文件的重复定义，那么预处理器就会进入死循环了。
3. 头文件里有些代码不允许重复出现。而重复定义头文件会重复出现一些代码。（虽然变量和函数允许多次声明（只要不是多次定义就行），但头文件里有些代码是不允许多次出现的）。例如：使用typedef类型定义和结构体Tag定义等，在一个程序文件中只允许出现一次。

##### 采用条件编译

```c++
#ifndef APP_H
#define APP_H
....
#endif //APP_H
```

##### 添加杂注

```c++
#pragma once
只要在头文件的最开始加入这条杂注，就能够保证头文件只被编译一次
```

​	\#ifndef，#define，#endif是C/C++语言中的宏定义，通过宏定义避免文件多次编译。所以在所有支持C++语言的编译器上都是有效的，如果写的程序要跨平台，最好使用这种方式。



#### #include "" 与 <>

 \#include <> 和 #include "" 都会在实现定义的位置查找文件，并将其包含

区别是若 #include "" 查找成功，则遮蔽 #include <> 所能找到的同名文件；否则再按照 #include <> 的方式查找文件。另外标准库头文件都放在 #include <> 所查找的位置。

一般来说 #include <> 的查找位置是标准库头文件所在目录， #include "" 的查找位置是当前源文件所在目录。不过这些都可由编译器调用参数等配置更改。

<>先去系统目录中找头文件，如果没有再到当前目录下找。所以像标准的头文件 stdio.h、stdlib.h等用这个方法。
而""首先在当前目录下寻找，如果找不到，再到系统目录中寻找。 这个用于include自定义的头文件，让系统优先使用当前目录中定义的。



#### 类的实现过程中探索编程习惯



类的设计习惯

- header头文件重复问题

- 数据放在private声明下，提供接口访问数据

- const返回不会改变（数据成员）的成员函数，加上const声明

  ```C++
  double real () `const` {return re;}
  double imag() `const` {return im;}
  而且，const对象才可以调用这些函数——const对象不能够调用非const成员函数。
  ```

- 使用构造函数初始值列表

```c++
class complex
{
    public:
        complex(double r = 0, double i =0)
            : re(r), im(i)  { }
    private:
        doubel re,im;
}
```

在初始值列表中，才是初始化。在构造函数体内的，叫做赋值

- 如果可以参数尽量使用reference to const

  ​	使用引用避免类对象构造与析构的开销，使用const确保参数不会被改变。内置类型的值传递与引用传递效率没有多大差别，甚至值传递效率会更高。


    for (int i = 0; i < 1000000000; i++)
    {
        ai += a->f(i, 10);
    }
    std::cout << ai << std::endl;
    return 0;
}
```

执行时间：12.706s

这两段代码的执行时间几乎没有区别，可见虚函数表导致的那一次函数间接调用并不浪费时间，所以虚函数的开销并不在重定 向上，这一次重定向基本上不影响程序性能。

那它的开销究竟在哪里呢？看下面两段代码，这两段代码和上面相比只改动了一行：

```c++
#include <cmath>
#include "../time_log/TimeLog.h"

struct Base {
    public:
        virtual int f(double i1, int i2) {
            return static_cast<int>(i1 * log(i1)) * i2;
        }
};

int main() {
    ysy::timer::TimerLog t("timer");
    Base *a = new Base();
    int ai = 0;
    for (int i = 0; i < 1000000000; i++)
    {
        ai += a->f(10, i);
    }
    std::cout << ai << std::endl;
    return 0;
}
```

执行时间：436ms

```c++
struct Base {
    public:
        virtual int f(double i1, int i2) {
            return static_cast<int>(i1 * log(i1)) * i2;
        }
};
```

执行时间 154ms

这里看到，仅仅改变了一行代码，虚函数调用就比普通函数慢了几倍，为什么？

虚函数其实最主要的性能开销在于**它阻碍了编译器内联函数和各种函数级别的优化**，导致性能开销较大，在 普通函数中 log(10)会被优化掉，它就只会被计算一次，而如果使用虚函数，log(10)不会被编译器优化，它就 会被计算多次。如果代码中使用了更多的虚函数，编译器能优化的代码就越少，性能就越低。

虚函数通常通过虚函数表来实现，在虚表中存储函数指针，实际调用时需要间接访问，这需要多一点时间。

然而这并不是虚函数速度慢的主要原因，

真正原因是编译器在**编译时通常并不知道它将要调用哪个函数**，**所 以它不能被内联优化和其它很多优化**，因此就会**增加很多无意义的指令**（准备寄存器、调用函数、保存状态 等），而且如果虚函数有很多实现方法，那**分支预测的成功率也会降低很多**，**分支预测错误也会导致程序性能下降**。

如果你想要写出高性能代码并频繁的调用虚函数，注意如果用其它的方式（例如 if-else、switch、函数指针 等）来替换虚函数调用并不能根本解决问题，它还有可能会更慢，真正的问题不是虚函数，而是那些不必要的间接调用

正常的函数调用：

1. 复制栈上的一些寄存器，以允许被调用的函数使用这些寄存器；
2.  将参数复制到预定义的位置，这样被调用的函数可以找到对应参数；
3. 入栈返回地址；
4. 跳转到函数的代码，这是一个编译时地址，因为编译器/链接器硬编码为二进制；
5. 从预定义的位置获取返回值，并恢复想要使用的寄存器。

而虚函数调用与此完全相同，唯一的区别就是编译时不知道函数的地址，而是：

1. 从对象中获取虚表指针，该指针指向一个函数指针数组，每个指针对应一个虚函数；
2. 从虚表中获取正确的函数地址，放到寄存器中；
3. 跳转到该寄存器中的地址，而不是跳转到一个硬编码的地址

通常，使用虚函数没问题，它的性能开销也不大，而且虚函数在面向对象代码中有强大的作用

但是不能无脑使用虚函数，特别是在性能至关重要的或者底层代码中，而且大项目中使用多态也会导致继承层次很混乱

那么有什么好方法替代虚函数呢？这里提供几个思路，读者请持续关注，后续会具体讲解

1. 使用访问者模式来使类层次结构可扩展；
2. 使用普通模板替代继承和虚函数；
3. C++20 中的 concepts 用来替代面向对象代码；
4. 使用 variants 替代虚函数或模板方法



#### C++ 的对象布局（干货）

- 普通类对象是什么布局
- 带虚函数的类对象是什么布局
- 单继承下不含有覆盖函数的类对象是什么布局
- 单继承下含有覆盖函数的类对象是什么布局
- 多继承下不含有覆盖函数的类对象是什么布局
- 多继承下含有覆盖函数的类对象是什么布局
- 虚继承的类对象是什么布局
- 菱形继承下类对象是什么布局
- 为什么引入虚集成
- 为什么虚函数表中有两个虚构函数
- 为什么构造函数不能是虚函数
- 为什么基类析构函数需要是虚函数？



**多态**

多态可以分为编译时多态和运行时多态

- 编译时多态：基于模板和函数重载方式，在编译时就已经确定对象的行为，也称为静态绑定
- 运行时多态：面向对象的一大特色，通过继承方式使得程序在运行时才会确定相应调用的方法，也称为动态绑定，它的实 现主要是依赖于传说中的虚函数表



**如何查看对象的布局**

在 gcc 中可以使用如下命令查看对象布局：

```sh
g++ -fdump-class-hierarchy model.cc 后查看生成的文件
```

在 clang 中可以使用如下命令：

```sh
clang -Xclang -fdump-record-layouts -stdlib=libc++ -c model.cc// 查看对象布局
clang -Xclang -fdump-vtable-layouts -stdlib=libc++ -c model.cc// 查看虚函数表布局
```

上面两种方式其实足够了，也可以使用 gdb 来查看内存布局，这里可以看文末相关参考资料。本文都是使用 clang 来查看的对 象布局。

接下来让我们一起来探秘下各种继承条件下类对象的布局情况吧~

**普通类对象的布局**

```c
#include <stdio.h>
struct Base {
    Base() = default;
    ~Base() = default;
    void Func() {}
    int a;
    int b;
};
int main() {
    Base a;
    return 0;
}
```

```sh
clang -Xclang -fdump-record-layouts -stdlib=libc++ -c model.cc
```

```sh
*** Dumping AST Record Layout
    0 | struct Base
    0 | int a
    4 | int b
    | [sizeof=8, dsize=8, align=4,
    | nvsize=8, nvalign=4]
*** Dumping IRgen Record Layout
```

从结果中可以看见，这个普通结构体 Base 的大小为 8 字节，a 占 4 个字节，b 占 4 个字节。



**带虚函数的类对象的布局**

```c++
struct Base {
    Base() = default;
    virtual ~Base() = default;
    virtual void FuncB() {
    	printf("FuncB\n");
    }
    int a;
    int b;
};
```

```sh
clang -Xclang -fdump-record-layouts -stdlib=libc++ -c model.cc
clang -Xclang -fdump-vtable-layouts -stdlib=libc++ -c model.cc
```

```sh
** Dumping AST Record Layout
    0 | struct Base
    0 | (Base vtable pointer)
    8 | int a
    12 | int b
    | [sizeof=16, dsize=16, align=8,
    | nvsize=16, nvalign=8]
*** Dumping IRgen Record Layout
```

这个含有虚函数的结构体大小为 16，在对象的头部，前 8 个字节是虚函数表的指针，指向虚函数的相应函数指针地址，a 占 4 个字节，b 占 4 个字节，总大小为 16。

虚函数表布局：

```sh
Vtable for 'Base' (5 entries).
    0 | offset_to_top (0)
    1 | Base RTTI
    -- (Base, 0) vtable address --
    2 | Base::~Base() [complete]
    3 | Base::~Base() [deleting]
    4 | void
```

画出对象布局图如下：

![img](https://imgconvert.csdnimg.cn/aHR0cHM6Ly9tbWJpei5xcGljLmNuL21tYml6X2pwZy85bEZGRmlhS3BFcmlieVZraWNTRkRLaWNiZHRNOFA5NWljMHc4RXdjaWJ0Sm9CdVBwWTRva0JObjhYblNLVkluZU85dkM0TEJkc2RzbDlYSGliUGM5ZDEzQ2VNTmcvNjQw?x-oss-process=image/format,png)

我们来探秘下传说中的虚函数表：

**offset_to_top(0)：** 表示当前这个虚函数表地址距离对象顶部地址的偏移量，因为对象的头部就是虚函数表的指针，所以偏移量 为 0

**RTTI 指针：**指向存储运行时类型信息(type_info)的地址，用于运行时类型识别，用于 typeid 和 dynamic_cast

RTTI 下面就是虚函数表指针真正指向的地址啦，存储了类里面所有的虚函数，至于这里为什么会有两个析构函数，大家可以先 关注对象的布局，最下面会介绍。



**单继承下不含有覆盖函数的类对象的布局**

```c++
struct Base {
    Base() = default;
    virtual ~Base() = default;
    void FuncA() {}
    virtual void FuncB() {
        printf("Base FuncB\n");
    }
    int a;
    int b;
};
struct Derive : public Base{};
int main() {
    Base a;
    Derive d;
    printf("%d\n", sizeof(a));
    printf("%d\n", sizeof(d));
    return 0;
}
```

```sh
*** Dumping AST Record Layout
    0 | struct Derive
    0 | struct Base (primary base)
    0 | (Base vtable pointer)
    8 | int a
    12 | int b
    | [sizeof=16, dsize=16, align=8,
    | nvsize=16, nvalign=8]
*** Dumping IRgen Record Layou
```

和上面相同，这个含有虚函数的结构体大小为 16，在对象的头部，前 8 个字节是虚函数表的指针，指向虚函数的相应函数指针 地址，a 占 4 个字节，b 占 4 个字节，总大小为 16。 

子类虚函数表布局：

```sh
vtable for 'Derive' (5 entries).
    0 | offset_to_top (0)
    1 | Derive RTTI
    -- (Base, 0) vtable address --
    -- (Derive, 0) vtable address --
    2 | Derive::~Derive() [complete]
    3 | Derive::~Derive() [deleting]
    4 | 
```

画图如下

![img](https://imgconvert.csdnimg.cn/aHR0cHM6Ly9tbWJpei5xcGljLmNuL21tYml6X2pwZy85bEZGRmlhS3BFcmlieVZraWNTRkRLaWNiZHRNOFA5NWljMHc4S2ljbHlpYlhQRmlidjcxOFYwUWVpY3FpY2t6bzF4RFV3QnRlMWliYXZqZHlPbWpsMFVZMlIxZm5mUjJBLzY0MA?x-oss-process=image/format,png)

这个和上面也是相同的，注意下虚函数表这里 的 FuncB 函数，还是 Base 类中的 FuncB，因为在子类中没有重写这个函数，那么如果子类重写这个函数后对象布局是什么样 的，请继续往下看哈。



**单继承下含有覆盖函数的类对象的布局**

注意这里虚函数表中的 FuncB 函数已经是 Derive 中的 FuncB 啦，因为在子类中重写了父类的这个函数

再注意这里的 RTTI 中有了两项，表示 Base 和 Derive 的虚表地址是相同的，Base 类里的虚函数和 Derive 类里的虚函数都在这 个链条下，这里可以继续关注下面多继承的情况，看看有何不同

![img](https://imgconvert.csdnimg.cn/aHR0cHM6Ly9tbWJpei5xcGljLmNuL21tYml6X3BuZy85bEZGRmlhS3BFcmlieVZraWNTRkRLaWNiZHRNOFA5NWljMHc4V2liaWNkcVFDZUlZcmliSW16eEpnQllwMHVyZDRVSTZSdG1wd29hWmljUzR3ZFdmVTRoMkc4YUlldy82NDA?x-oss-process=image/format,png)



**多继承下不含有覆盖函数的类对象的布局**

类对象布局

```sh
*** Dumping AST Record Layout
    0 | struct Derive
        0 | struct BaseA (primary base)
            0 | (BaseA vtable pointer)
            8 | int a
            12 | int b
        16 | struct BaseB (base)
            16 | (BaseB vtable pointer)
            24 | int a
            28 | int b
    | [sizeof=32, dsize=32, align=8,
    | nvsize=32, nvalign=8
```

Derive 大小为 32，注意这里有了两个虚表指针，因为 Derive 是多继承，一般情况下继承了几个带有虚函数的类，对象布局中 就有几个虚表指针，并且子类也会继承基类的数据，一般来说，不考虑内存对齐的话，子类（继承父类）的大小=子类（不继 承父类）的大小+所有父类的大小。

 虚函数表布局：

```sh
Vtable for 'Derive' (10 entries).
0 | offset_to_top (0)
1 | Derive RTTI
    -- (BaseA, 0) vtable address --
    -- (Derive, 0) vtable address --
2 | Derive::~Derive() [complete]
3 | Derive::~Derive() [deleting]
4 | void BaseA::FuncB()
5 | offset_to_top (-16)
6 | Derive RTTI
-- (BaseB, 16) vtable address --
7 | Derive::~Derive() [complete]
	[this adjustment: -16 non-virtual]
8 | Derive::~Derive() [deleting]
	[this adjustment: -16 non-virtual]
9 | void BaseB::FuncC()
```

可画出对象布局图如下：

![img](https://imgconvert.csdnimg.cn/aHR0cHM6Ly9tbWJpei5xcGljLmNuL21tYml6X3BuZy85bEZGRmlhS3BFcmlieVZraWNTRkRLaWNiZHRNOFA5NWljMHc4bDRjcTVHS3ZzdTY3U1EwUWN0aFpEMGpoWTFsUVphYndQS0ozaEtCTjhvb3lFQ0pGbzBhbnJnLzY0MA?x-oss-process=image/format,png)

**offset_to_top(0)：**表示当前这个虚函数表（BaseA，Derive）地址距离对象顶部地址的偏移量，因为对象的头部就是虚函数表的 指针，所以偏移量为 0

再注意这里的 RTTI 中有了两项，表示 BaseA 和 Derive 的虚表地址是相同的，BaseA 类里的虚函数和 Derive 类里的虚函数都在 这个链条下，截至到 offset_to_top(-16)之前都是 BaseA 和 Derive 的虚函数表

**offset_to_top(-16)：**表示当前这个虚函数表（BaseB）地址距离对象顶部地址的偏移量，因为对象的头部就是虚函数表的指针， 所以偏移量为-16，这里用于 this 指针偏移，下一小节会介绍

注意下后面的这个 RTTI：只有一项，表示 BaseB 的虚函数表，后面也有两个虚析构函数，为什么有四个 Derive 类的析构函数 呢，又是怎么调用呢，请继续往下看~



**多继承下含有覆盖函数的类对象的布局**

```C++
struct BaseA {
   BaseA() = default;
   virtual ~BaseA() = default;
   
   void FuncA() {}
 
 
   virtual void FuncB() {
       printf("BaseA FuncB\n");
  }
    
   int a;
   int b;
};
 
 
struct BaseB {
   BaseB() = default;
   virtual ~BaseB() = default;
   
   void FuncA() {}
 
 
   virtual void FuncC() {
       printf("BaseB FuncC\n");
  }
 
 
   int a;
   int b;
};
 
 
struct Derive : public BaseB, public BaseA{
   void FuncB() override {
       printf("Derive FuncB \n");
  }
 
 
   void FuncC() override {
       printf("Derive FuncC \n");
  }
};
 
 
int main() {
   BaseA a;
   Derive d;
   return 0;
}
```

对象布局

```sh
*** Dumping AST Record Layout
0 | struct Derive
0 | 	struct BaseA (primary base)
        0 | (BaseA vtable pointer)
        8 | int a
        12 | int b
16 | 	struct BaseB (base)
        16 | (BaseB vtable pointer)
        24 | int a
        28 | int b
| [sizeof=32, dsize=32, align=8,
| nvsize=32, nvalign=8]
*** Dumping IRgen Record Layout
```

类大小仍然是 32，和上面一样。

 虚函数表布局：

```sh
Vtable for 'Derive' (11 entries).
  0 | offset_to_top (0)
  1 | Derive RTTI
      -- (BaseB, 0) vtable address --
      -- (Derive, 0) vtable address --
  2 | Derive::~Derive() [complete]
  3 | Derive::~Derive() [deleting]
  4 | void Derive::FuncC()
  5 | void Derive::FuncB()
  6 | offset_to_top (-16)
  7 | Derive RTTI
      -- (BaseA, 16) vtable address --
  8 | Derive::~Derive() [complete]
      [this adjustment: -16 non-virtual]
  9 | Derive::~Derive() [deleting]
      [this adjustment: -16 non-virtual]
 10 | void Derive::FuncB()
      [this adjustment: -16 non-virtual]
```

对象布局图如下：

![img](https://imgconvert.csdnimg.cn/aHR0cHM6Ly9tbWJpei5xcGljLmNuL21tYml6X3BuZy85bEZGRmlhS3BFcmlieVZraWNTRkRLaWNiZHRNOFA5NWljMHc4bDRjcTVHS3ZzdTY3U1EwUWN0aFpEMGpoWTFsUVphYndQS0ozaEtCTjhvb3lFQ0pGbzBhbnJnLzY0MA?x-oss-process=image/format,png)

虚函数表的布局也有所不同，BaseB和Derive共用一个虚表地址，在整个虚表布局的上方，而布局的下半部分是BaseA的虚表，可见继承顺序不同，子类的虚表布局也有所不同。

**虚集成的布局**

```c++
struct Base {
   Base() = default;
   virtual ~Base() = default;
   
   void FuncA() {}
 
 
   virtual void FuncB() {
       printf("BaseA FuncB\n");
  }
 
 
   int a;
   int b;
};
 
 
struct Derive : virtual public Base{
   void FuncB() override {
       printf("Derive FuncB \n");
  }
};
 
 
int main() {
   Base a;
   Derive d;
   return 0;
}
```

对象布局：

```
*** Dumping AST Record Layout
        0 | struct Derive
        0 |   (Derive vtable pointer)
        8 |   struct Base (virtual base)
        8 |     (Base vtable pointer)
       16 |     int a
       20 |     int b
          | [sizeof=24, dsize=24, align=8,
          |  nvsize=8, nvalign=8]
 
 
*** Dumping IRgen Record Layout
```

虚继承下，这里的对象布局和普通单继承有所不同，普通单继承下子类和基类共用一个虚表地址，而在虚继承下，子类和**虚基类分别有一个虚表地址的指针**，两个指针大小总和为16，再加上a和b的大小8，为24。

**虚函数表**

```sh
Vtable for 'Derive' (13 entries).
  0 | vbase_offset (8)
  1 | offset_to_top (0)
  2 | Derive RTTI
      -- (Derive, 0) vtable address --
  3 | void Derive::FuncB()
  4 | Derive::~Derive() [complete]
  5 | Derive::~Derive() [deleting]
  6 | vcall_offset (-8)
  7 | vcall_offset (-8)
  8 | offset_to_top (-8)
  9 | Derive RTTI
      -- (Base, 8) vtable address --
 10 | Derive::~Derive() [complete]
      [this adjustment: 0 non-virtual, -24 vcall offset offset]
 11 | Derive::~Derive() [deleting]
      [this adjustment: 0 non-virtual, -24 vcall offset offset]
 12 | void Derive::FuncB()
      [this adjustment: 0 non-virtual, -32 vcall offset offset]
```

对象布局图如下：

![img](https://imgconvert.csdnimg.cn/aHR0cHM6Ly9tbWJpei5xcGljLmNuL21tYml6X3BuZy85bEZGRmlhS3BFcmlieVZraWNTRkRLaWNiZHRNOFA5NWljMHc4VFJkWVdtYVJpYnZpY3lhSVNqR0ZhWk5pYlMwaWNLMHJZU043a2licWwzZXl3WEJvNFhkUTQyV3pQaWFRLzY0MA?x-oss-process=image/format,png)

**vbase_offset(8)**：对象在对象布局中与指向虚基类虚函数表的指针地址的偏移量

**vcall_offset(-8)**：当**虚基类**Base的引用或指针base实际接受的是Derive类型的对象，执行base->FuncB()时候，由于FuncB()已经被重写，而此时的this指针指向的是Base类型的对象，需要对this指针进行调整，就是vcall_offset(-8)，所以this指针向上调整了8字节，之后调用FuncB()，就调用到了被重写后的FuncB()函数。



**虚继承带未覆盖函数的对象布局**

```C++
struct Base {
   Base() = default;
   virtual ~Base() = default;
   void FuncA() {}
   virtual void FuncB() {
       printf("Base FuncB\n");
  }
   virtual void FuncC() {
       printf("Base FuncC\n");
  }
   int a;
   int b;
};
 
struct Derive : virtual public Base{
   void FuncB() override {
       printf("Derive FuncB \n");
  }
};
 
int main() {
   Base a;
   Derive d;
   return 0;
}
```

对象布局：

```sh
*** Dumping AST Record Layout
        0 | struct Derive
        0 |   (Derive vtable pointer)
        8 |   struct Base (virtual base)
        8 |     (Base vtable pointer)
       16 |     int a
       20 |     int b
          | [sizeof=24, dsize=24, align=8,
          |  nvsize=8, nvalign=8]
 
 
*** Dumping IRgen Record Layout
```

和上面虚继承情况下相同，普通单继承下子类和基类共用一个虚表地址，而在虚继承下，子类和虚基类分别有一个虚表地址的指针，两个指针大小总和为16，再加上a和b的大小8，为24。

虚函数表布局：

```sh
Vtable for 'Derive' (15 entries).
  0 | vbase_offset (8)
  1 | offset_to_top (0)
  2 | Derive RTTI
      -- (Derive, 0) vtable address --
  3 | void Derive::FuncB()
  4 | Derive::~Derive() [complete]
  5 | Derive::~Derive() [deleting]
  6 | vcall_offset (0)
  7 | vcall_offset (-8)
  8 | vcall_offset (-8)
  9 | offset_to_top (-8)
 10 | Derive RTTI
      -- (Base, 8) vtable address --
 11 | Derive::~Derive() [complete]
      [this adjustment: 0 non-virtual, -24 vcall offset offset]
 12 | Derive::~Derive() [deleting]
      [this adjustment: 0 non-virtual, -24 vcall offset offset]
 13 | void Derive::FuncB()
      [this adjustment: 0 non-virtual, -32 vcall offset offset]
 14 | void Base::FuncC()
```

对象布局图如下：

![img](https://imgconvert.csdnimg.cn/aHR0cHM6Ly9tbWJpei5xcGljLmNuL21tYml6X3BuZy85bEZGRmlhS3BFcmlieVZraWNTRkRLaWNiZHRNOFA5NWljMHc4SXF5d1ZJRTFjVlZTUXJLNzRWTjVJZHViZUFBUHdXRGdudjUzcTRuVWI2OFBSbTE1aWFQaWN1RmcvNjQw?x-oss-process=image/format,png)

**vbase_offset(8)**：对象在对象布局中与指向虚基类虚函数表的指针地址的偏移量

**vcall_offset(-8)**：当**虚基类**Base的引用或指针base实际接受的是Derive类型的对象，执行base->FuncB()时候，由于FuncB()已经被重写，而此时的this指针指向的是Base类型的对象，需要对this指针进行调整，就是vcall_offset(-8)，所以this指针向上调整了8字节，之后调用FuncB()，就调用到了被重写后的FuncB()函数。

**vcall_offset(0)**：当Base的引用或指针base实际接受的是Derive类型的对象，执行base->FuncC()时候，由于FuncC()没有被重写，所以不需要对this指针进行调整，就是vcall_offset(0)，之后调用FuncC()。



**菱形继承下类对象的布局**

```c++
struct Base {
   Base() = default;
   virtual ~Base() = default;
   
   void FuncA() {}
   virtual void FuncB() {
       printf("BaseA FuncB\n");
  }
   int a;
   int b;
};
 
 
struct BaseA : virtual public Base {
   BaseA() = default;
   virtual ~BaseA() = default;
   void FuncA() {}
 
   virtual void FuncB() {
       printf("BaseA FuncB\n");
  }
 
 
   int a;
   int b;
};
 
 
struct BaseB : virtual public Base {
   BaseB() = default;
   virtual ~BaseB() = default;
   
   void FuncA() {}
 
   virtual void FuncC() {
       printf("BaseB FuncC\n");
  }

   int a;
   int b;
};

struct Derive : public BaseB, public BaseA{
   void FuncB() override {
       printf("Derive FuncB \n");
  }

   void FuncC() override {
       printf("Derive FuncC \n");
  }
};

int main() {
   BaseA a;
   Derive d;
   return 0;
}
```

类对象布局：

```sh
*** Dumping AST Record Layout
        0 | struct Derive
        0 |   struct BaseB (primary base)
        0 |     (BaseB vtable pointer)
        8 |     int a
       12 |     int b
       16 |   struct BaseA (base)
       16 |     (BaseA vtable pointer)
       24 |     int a
       28 |     int b
       32 |   struct Base (virtual base)
       32 |     (Base vtable pointer)
       40 |     int a
       44 |     int b
          | [sizeof=48, dsize=48, align=8,
          |  nvsize=32, nvalign=8]
 
 
*** Dumping IRgen Record Layout
```

虚函数表：

```sh
Vtable for 'Derive' (20 entries).
  0 | vbase_offset (32)
  1 | offset_to_top (0)
  2 | Derive RTTI
      -- (BaseB, 0) vtable address --
      -- (Derive, 0) vtable address --
  3 | Derive::~Derive() [complete]
  4 | Derive::~Derive() [deleting]
  5 | void Derive::FuncC()
  6 | void Derive::FuncB()
  7 | vbase_offset (16)
  8 | offset_to_top (-16)
  9 | Derive RTTI
      -- (BaseA, 16) vtable address --
 10 | Derive::~Derive() [complete]
      [this adjustment: -16 non-virtual]
 11 | Derive::~Derive() [deleting]
      [this adjustment: -16 non-virtual]
 12 | void Derive::FuncB()
      [this adjustment: -16 non-virtual]
 13 | vcall_offset (-32)
 14 | vcall_offset (-32)
 15 | offset_to_top (-32)
 16 | Derive RTTI
      -- (Base, 32) vtable address --
 17 | Derive::~Derive() [complete]
      [this adjustment: 0 non-virtual, -24 vcall offset offset]
 18 | Derive::~Derive() [deleting]
      [this adjustment: 0 non-virtual, -24 vcall offset offset]
 19 | void Derive::FuncB()
      [this adjustment: 0 non-virtual, -32 vcall offset offset]
```

对象布局图如下：

![img](https://imgconvert.csdnimg.cn/aHR0cHM6Ly9tbWJpei5xcGljLmNuL21tYml6X3BuZy85bEZGRmlhS3BFcmlieVZraWNTRkRLaWNiZHRNOFA5NWljMHc4Ykg3WjBtUThWVDRISlFuZWliajFGMWxXV2JUZWh2UzJ0SkEwdjFpY21xUHBIZUtvaWNwSWtQd3ZRLzY0MA?x-oss-process=image/format,png)



**vbase_offset (32)**

**vbase_offset (16)**：对象在对象布局中与指向虚基类虚函数表的指针地址的偏移量

**offset_to_top (0)**

**offset_to_top (-16)**

**offset_to_top (-32)**：指向虚函数表的地址与对象顶部地址的偏移量。

